local _, ns = ...;

ns.ADF_SIZE = 28;
ns.ADF_TARGET_DEBUFF_X = 75 + 30 + 20;
ns.ADF_TARGET_DEBUFF_Y = -110 - 28;
ns.ADF_PLAYER_DEBUFF_X = -75 - 30 - 20;
ns.ADF_PLAYER_DEBUFF_Y = -110 - 28;
ns.ADF_MAX_DEBUFF_SHOW = 7;
ns.ADF_ALPHA = 1
ns.ADF_CooldownFontSize = 12 -- Cooldown Font Size
ns.ADF_CountFontSize = 11;   -- Count Font Size
ns.ADF_AlphaCombat = 1;      -- 전투중 Alpha 값
ns.ADF_AlphaNormal = 0.5;    -- 비 전투중 Alpha 값
ns.ADF_MAX_Cool = 120        -- 최대 120초까지의 Debuff를 보임

-- ANameP_ShowList_직업_특성 숫자
-- 아래와 같은 배열을 추가 하면 된다.
-- ["디법명"] = {알림 시간, 우선순위, 색상 변경 여부},
-- 우선순위는 숫자가 큰 경우 우선적으로 보이고, 같을 경우 먼저 걸린 순서로 보임
ns.ShowList_WARRIOR_1 = {
    [445584] = { 0, 5, 2 },         --사형 선고됨
    [447513] = { 0, 4, 2 },         --만신창이
    [388539] = { 1, 3, 1 },         --분쇄
}

ns.ShowList_WARRIOR_2 = {
    [445584] = { 0, 5, 1 },         --사형 선고됨
}

ns.ShowList_WARRIOR_3 = {
    [447513] = { 0, 5 },            --만신창이
    [388539] = { 1, 4 },            --분쇄
}

ns.ShowList_ROGUE_1 = {
    [457129] = { 0, 5 },            --죽음추적자의 징표
    [703] = { 1, 4, 2, false, true },            --목조르기
    [1943] = { 24 * 0.3, 3, 1 },    --파열
    [121411] = { 12 * 0.3, 2 },     --혈폭풍
}

ns.ShowList_ROGUE_2 = {
    [196937] = { 0, 5, 1 },         --유령의 일격
    [441224] = { 0, 4, 2 },         --당혹 상태

}

ns.ShowList_ROGUE_3 = {
    [457129] = { 0, 5, 2 },         --죽음추적자의 징표
    [1943] = { 24 * 0.3, 4, 1 },    --파열
    [441224] = { 0, 3, 2 },         --당혹 상태
}


ns.ShowList_HUNTER_1 = {
    [468572] = { 0, 5, 2},          --검은 화살
    [217200] = { 1, 4, 1 },         --날카로운 사격     
    [271788] = { 0, 3 },            --독사 쐐기
    [131894] = { 0, 2 },            --저승까마귀
    [257284] = { 0, 1 },            --사냥꾼의 징표
}

ns.ShowList_HUNTER_2 = {
    [468572] = { 0, 5, 2},          --검은 화살
    [271788] = { 1, 4, 1 },         --독사 쐐기     
    [450387] = { 0, 3 },            --파수꾼
    [257284] = { 0, 2 },            --사냥꾼의 징표

}

ns.ShowList_HUNTER_3 = {
    [259491] = { 1, 5, 1 },         --독사 쐐기
    [450387] = { 0, 4 },            --파수꾼
    [257284] = { 0, 3 },            --사냥꾼의 징표

}

ns.ShowList_MONK_1 = {
    [387179] = { 0, 5},     --질서의 무기  
}

ns.ShowList_MONK_2 = {
}

ns.ShowList_MONK_3 = {
    [228287] = { 0, 5, 1 },             --주학의 징표  
}

ns.ShowList_WARLOCK_1 = {
    [980] = { 1, 5, 1 },                --고통
    [316099] = { 1, 4 },                --불안정한 고통
    [146739] = { 1, 3, 2 },             --부패
    [445474] = { 1, 2, 2 },             --쇠퇴    
}

ns.ShowList_WARLOCK_2 = {
    [460553] = { 0, 5, 2 },             --파멸   
    [270569] = { 0, 4, 1 },             --악의 아귀
}


ns.ShowList_WARLOCK_3 = {
    [157736] = { 1, 5, 1 },             --제물
    [445474] = { 1, 4, 1 },             --쇠퇴
}


ns.ShowList_PRIEST_1 = {
    [204213] = { 1, 5, 1 },             --사악의 정화
    [589] = { 1, 4, 1 },                --고통
}

ns.ShowList_PRIEST_2 = {
    [14914] = { 0, 5, 1 },              --신충
    [589] = { 1, 4, 2 },                --고통
}


ns.ShowList_PRIEST_3 = {
    [589] = { 1, 5, 1 },                --고통
    [34914] = { 0, 4 },                 --흡선
    [335467] = { 0, 3, 2 },             --파멸
    [453850] = { 0, 2 },                --공명
}

ns.ShowList_SHAMAN_1 = {
    [188389] = { 18 * 0.3, 5, 1 },      --화염 충격
    [197209] = { 0, 4, 2 },             --피뢰침
}

ns.ShowList_SHAMAN_2 = {
    [188389] = { 18 * 0.3, 5, 1 },      --화염 충격
    [334168] = { 0, 4, 2 },             --채찍 화염
    [197209] = { 0, 3, 2 },             --피뢰침
}

ns.ShowList_SHAMAN_3 = {
    [188389] = { 18 * 0.31, 5, 1 },     --화염 충격  
}


ns.ShowList_DRUID_1 = {
    [164812] = { 1, 5, 1 },             --달빛섬광
    [164815] = { 1, 4, 2 },             --태양섬광
    [202347] = { 1, 3 },                --항성의 섬광
    [81282] = { 0, 2 },                --진균 번식
    [430589] = { 0, 1 },                --기후 노출
}


ns.ShowList_DRUID_2 = {
    [155722] = { 12 * 0.3, 5, 1, false, true }, --갈퀴 발톱
    [155625] = { 1, 4, 2, false, true },        --달빛섬광
    [391889] = { 1, 3 },           --적응의 무리
    [1079] = { 19 * 0.3, 2, nil, false, true },      --도려내기
    [405233] = { 1, 1, nil, false, true },           --Trash
    
}

ns.ShowList_DRUID_3 = {
    [164812] = { 1, 5 },                --달빛섬광
    [192090] = { 0, 4 },                --난타
    [430589] = { 0, 3 },                --기후 노출
}


ns.ShowList_DRUID_4 = {
    [164812] = { 1, 5, 1 },             --달빛섬광
    [155722] = { 12 * 0.3, 4, 2 },      --갈퀴 발톱
    [164815] = { 1, 3 },                --태양섬광    
    [1079] = { 19 * 0.3, 2 },           --도려내기
    [439531] = { 0, 1 },                --피바라미 덩굴
}


ns.ShowList_MAGE_1 = {
    [210824] = { 0, 5, 1 },             --비전의 여파
    [453599] = { 0, 4 },                --비전 쇠약
    [444735] = { 0, 3 },                --박힌 쐐편 파편
}

ns.ShowList_MAGE_2 = {
    [453268] = { 0, 5, 1 },             --파괴 제어
    [12654] = { 0, 4 },                 --작열
}

ns.ShowList_MAGE_3 = {
    [228358] = { 0, 5, 1 },             -- 혹한의 추위
    [443740] = { 0, 4 },                --박힌 냉기 파편
    [122] = {0, 3, 2},
    [136511] = {0, 3, 2},
    [33395] = {0, 3, 2},
    [157997] = {0, 3, 2}, 
    [378760] = {0, 3, 2},               --냉증
    [228600] = {0, 3, 2},               --혹한의 쐐기

}


ns.ShowList_DEATHKNIGHT_1 = {
    [434765] = { 0, 5, 1 },             --사신의 징표
    [458478] = { 0, 4 },                --공포 유발
    [55078] = { 0, 3 },                 --피의 역병

}

ns.ShowList_DEATHKNIGHT_2 = {
    [434765] = { 0, 5, 1 },             --사신의 징표
    [55095] = { 0, 4 },                 --서리 열병
}

ns.ShowList_DEATHKNIGHT_3 = {
    [458478] = { 0, 5, 2 },             --공포 유발      
    [194310] = { 0, 4 },                --고름 상처
    [191587] = { 1, 3, 1 },             --악성 역병    
    
}


ns.ShowList_EVOKER_1 = {
    [357209] = { 0, 5, 1 },             --불의 숨결       
    [434473] = { 0, 4 },                --폭격
}

ns.ShowList_EVOKER_2 = {
    [357209] = { 0, 5, 1 },             --불의 숨결

}

ns.ShowList_EVOKER_3 = {

    [409560] = { 0, 5, 1 },             --시간의 상처
    [357209] = { 0, 4, 2 },             --불의 숨결
    [434473] = { 0, 3 },                --폭격
}


ns.ShowList_PALADIN_1 = {
    [414022] = { 0, 5, 1 },                --무가치한 존재
}

ns.ShowList_PALADIN_2 = {
    [197277] = { 0, 5 },                    --심판
}

ns.ShowList_PALADIN_3 = {
    [197277] = { 0, 5, 1 },                  --심판
}

ns.ShowList_DEMONHUNTER_1 = {
    [442624] = { 0, 5, 2 },                 --파괴자의 징표
    [391191] = { 0, 4, 1 },                 --불타는 상처
}

ns.ShowList_DEMONHUNTER_2 = {
    [442624] = { 0, 5 },                    --파괴자의 징표
    [207771] = { 0, 4 },                    --불타는 낙인
    [247456] = { 0, 3 },                    --약화
}
